import * as S from './TermsArticle.styled';

export const TermsArticle2 = () => {
  return (
    <S.Section>
      <S.H3>제2장 회원</S.H3>
      <S.Article>
        <S.H4 id="제8조 (가입신청 및 거부)">제8조 (가입신청 및 거부)</S.H4>
        <S.Ol>
          <S.Li>
            1. 이용자는 회사가 정한 가입 양식에 따라 회원정보를 기입한 후 이
            약관에 동의한다는 의사표시를 함으로써 회원가입을 신청합니다.
          </S.Li>
          <S.Li>
            2. 회원은 반드시 회원 본인의 식별이 가능한 인증정보 및 개인정보를
            제공하여야만 서비스를 이용할 수 있습니다. 본인인증을 통해 등록되지
            않은 사용자는 서비스의 제한을 받을 수 있으며, 일체의 권리를 주장할
            수 없습니다.
          </S.Li>
          <S.Li>
            3. 회사는 제 1 항과 같이 회원으로 가입할 것을 신청한 이용자 중 다음
            각호에 해당되지 않는 한 회원으로 등록합니다.
            <S.Ul>
              <S.Li depth={2}>
                ① 가입신청자가 본 약관 제13조 제3항에 의하여 이전에 회원자격을
                상실한 적이 있는 경우, 다만 제13조 제3항에 의한 회원자격 상실 후
                3년이 경과한 자로서 회사의 회원 재가입 승낙을 얻은 경우에는
                예외로 한합니다.
              </S.Li>
              <S.Li depth={2}>
                ② 신청, 등록 내용에 허위, 기재누락, 오기가 있는 경우
              </S.Li>
              <S.Li depth={2}>③ 만 14 세 미만의 자가 신청하였을 경우</S.Li>
              <S.Li depth={2}>
                ④ 이미 가입된 회원과 이름 및 CI(본인확인기관의 개인식별정보),
                DI(중복가입 확인정보)가 동일한 경우
              </S.Li>
              <S.Li depth={2}>
                ⑤ 이 약관에 위배되거나 부당한 이용 신청임이 확인되는 경우
              </S.Li>
              <S.Li depth={2}>
                ⑥ 기타 회원으로 등록하는 것이 회사의 기술상 현저히 지장이 있다고
                판단되는 경우
              </S.Li>
            </S.Ul>
          </S.Li>
          <S.Li>
            6. 회원 가입계약의 성립시기는 회사의 승낙이 회원에게 도달한 시점으로
            합니다.
          </S.Li>
          <S.Li>
            7. 회원은 제23조에 의한 등록사항에 변경이 있는 경우, 즉시 전자우편
            등 기타 방법으로 그 변경사항을 알려야 합니다. 이러한 변경사항의 미
            통보로 인해 발생하는 손해는 회원에게 그 책임이 있습니다.
          </S.Li>
        </S.Ol>
      </S.Article>
      <S.Article>
        <S.H4 id="제9조 (이용자의 아이디 및 비밀번호에 대한 의무)">
          제9조 (이용자의 아이디 및 비밀번호에 대한 의무)
        </S.H4>
        <S.Ol>
          <S.Li>
            1. 아이디와 비밀번호에 관한 관리책임은 이용자에게 있으며, 이용자의
            고의, 과실로 타인이 사용하게 되어 일어날 수 있는 금전적 손실 등 각종
            손해에 대한 책임은 이용자 본인에게 있습니다.
          </S.Li>
          <S.Li>
            2. 이용자는 자신의 아이디 및 비밀번호, 회원번호, 회원카드는 본인이
            직접 사용하여야 하며 제 3 자에게 이용하게 해서는 안됩니다.
          </S.Li>
          <S.Li>
            3. 이용자의 주소, 이메일 등이 변경되었을 경우에는 사전에 통지하거나
            변경해야 하며 변경하지 않아서 발생하는 사고에 대한 책임은 회원
            본인에게 있습니다.
          </S.Li>
          <S.Li>
            4. 이용자가 자신의 아이디 및 비밀번호를 도난당하거나 제 3 자가
            사용하고 있음을 인지한 경우에는 바로 회사에 통보하고 회사의 안내가
            있는 경우에는 그에 따라야 합니다.
          </S.Li>
        </S.Ol>
      </S.Article>
      <S.Article>
        <S.H4 id="제10조 (이용자의 의무)">제10조 (이용자의 의무)</S.H4>
        <S.Ol>
          <S.Li>
            1. 이용자는 다음 행위를 하여서는 안됩니다.
            <S.Ul>
              <S.Li depth={2}>
                ① 개인정보의 입력 시 허위내용을 등록(변경의 경우 포함)
              </S.Li>
              <S.Li depth={2}>② 회사에 게시된 정보를 임의로 변경</S.Li>
              <S.Li depth={2}>
                ③ 회사가 정한 정보 이외의 정보(컴퓨터 프로그램 등)의 송신 또는
                게시
              </S.Li>
              <S.Li depth={2}>
                ④ 회사 기타 제3자의 저작권 등 지적재산권에 대한 침해
              </S.Li>
              <S.Li depth={2}>
                ⑤ 회사 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
              </S.Li>
              <S.Li depth={2}>
                ⑥ 외설 또는 폭력적인 메시지 화상 음성 기타 공서양속에 반하는
                정보를 화면에 공개 또는 게시하는 행위
              </S.Li>
              <S.Li depth={2}>
                ⑦ 불특정 다수의 자를 대상으로 회사의 서비스를 이용하여
                영리목적으로 활동하는 행위
              </S.Li>
              <S.Li depth={2}>
                ⑧ 사실관계를 왜곡하는 정보제공 행위 등 기타 회사가 부적절하다고
                판단하는 행위
              </S.Li>
              <S.Li depth={2}>⑨ 타인의 정보 도용</S.Li>
              <S.Li depth={2}>⑩ 기타 사회통념 상 부정한 행위</S.Li>
            </S.Ul>
          </S.Li>
          <S.Li>
            2. 이용자는 서비스를 이용함에 있어 아래의 행위를 하여서는 안되며,
            해당 행위를 하는 경우에는 서비스 혜택을 지급받지 못합니다.
            <S.Ol>
              <S.Li depth={2}>① 악의적인 이용</S.Li>
              <S.Li depth={2}>
                ② 여러 회원 아이디를 이용해 부정 적립하는 경우
              </S.Li>
            </S.Ol>
          </S.Li>
        </S.Ol>
      </S.Article>
      <S.Article>
        <S.H4>제11조 (회원탈퇴 및 자격 상실)</S.H4>
        <S.Ol>
          <S.Li>
            1. 회원은 회사에 언제든지 탈퇴를 요청할 수 있으며 회사는 즉시
            회원탈퇴 요청을 처리합니다.
          </S.Li>
          <S.Li>
            2. 회원은 정보제공에 동의한 이후에도 회사가 제휴한 사이트에
            회원정보를 제공하는 것을 원하지 않을 경우 언제라도 동의 철회를
            요청할 수 있습니다.
          </S.Li>
          <S.Li>
            3. 회원이 다음의 각호에 해당되는 경우 회사는 회원에게 사전고지
            후(다만, 불가피한 경우 사후에 통지 합니다) 서비스의 이용을
            제한하거나 일정기간 회원의 자격을 정지시킬 수 있습니다.
            <S.Ul>
              <S.Li depth={2}>
                ① 가입 시에 허위 내용을 등록하거나 제8조의 신청거부 사유가
                있었음이 밝혀진 경우.
              </S.Li>
              <S.Li depth={2}>
                ② 타인의 아이디와 비밀번호 또는 그 개인정보를 도용한 경우
              </S.Li>
              <S.Li depth={2}>
                ③ 사이트의 화면에서 타인의 명예를 손상시키거나 불이익을 주는
                행위를 한 경우
              </S.Li>
              <S.Li depth={2}>
                ④ 회사를 이용하여 법령 또는 이 약관이 금지하거나 공서양속에
                반하는 행위를 하는 경우
              </S.Li>
              <S.Li depth={2}>
                ⑤ 기타 다음과 같은 행위 등을 반복하여 회사의 건전한 운영을
                해하거나 회사의 업무서비스 운영을 고의로 방해하는 행위를 하는
                경우
                <S.Ul>
                  <S.Li depth={3}>
                    - 회사의 운영에 관련하여 근거 없는 사실 또는 허위의 사실을
                    적시하거나 유포하여 회사의 명예를 실추시키거나 회사의
                    신뢰성을 해하는 경우
                  </S.Li>
                  <S.Li depth={3}>
                    - 회사의 이용과정에서 회사의 직원에게 폭언 또는 음란한
                    언행을 하여 업무환경을 심각히 해하는 경우
                  </S.Li>
                  <S.Li depth={3}>
                    - 회사의 이용과정에서 이유 없는 잦은 연락이나 소란 또는
                    협박, 인과관계가 입증되지 않는 피해에 대한 보상(적립금,
                    현금, 상품 등) 요구 등으로 업무를 방해하는 경우
                  </S.Li>
                  <S.Li depth={3}>
                    - 회사를 통해 구입한 재화 또는 용역에 특별한 하자가 없는데도
                    불구하고 일부 사용 후 상습적으로 전부 또는 일부를 반품하는
                    등 업무를 방해하는 경우
                  </S.Li>
                </S.Ul>
              </S.Li>
              <S.Li depth={2}>
                ⑥ 다른 사람의 회사 이용을 방해하거나 그 정보를 도용하는 등
                전자거래질서를 위협하는 경우
              </S.Li>
              <S.Li depth={2}>
                ⑦ 회원이 부정하게 회원정보를 수집 및 이용한 경우
              </S.Li>
            </S.Ul>
          </S.Li>
          <S.Li>
            4. 회사가 회원 자격을 제한·정지시킨 후, 동일한 행위를 2회 이상
            반복되거나 30일 이내에 그 사유를 시정하지 아니하는 경우 회사는
            회원자격을 상실시킬 수 있습니다.
          </S.Li>
          <S.Li>
            5. 회사가 회원자격을 상실시키는 경우에는 회원등록을 말소합니다.
          </S.Li>
        </S.Ol>
      </S.Article>
    </S.Section>
  );
};
