import * as S from './TermsArticle.styled';

const TermsArticle4 = () => {
  return (
    <S.Section>
      <S.H3 id="제4장 게시물과 커뮤니티">제4장 게시물과 커뮤니티</S.H3>
      <S.Article>
        <S.H4 id="제13조 (저작권 귀속 및 이용제한)">
          제13조 (저작권 귀속 및 이용제한)
        </S.H4>
        <S.Ol>
          <S.Li>
            1. 회사가 창작 작성한 저작물에 대한 저작권 및 기타 지적 재산권은
            회사에 귀속하며 이용자는 회사의 동의 없이 무단으로 사용할 수
            없습니다.
          </S.Li>
          <S.Li>
            2. 회사는 서비스와 관련하여 회원에게 회사가 정한 이용조건에 따라
            계정, 아이디(ID), 콘텐츠 등을 이용할 수 있는 이용권한만을 부여하며,
            회원은 서비스를 이용함으로써 얻은 정보 중 회사에게 지식재산권이
            귀속된 정보를 회사의 사전 승낙 없이 복제, 송신, 전송, 출판, 배포,
            방송 기타 방법에 의하여 영리 목적으로 이용하거나 제3자에게 이용하게
            하여서는 안됩니다.
          </S.Li>
          <S.Li>
            3. 회사는 약정에 따라 이용자에게 귀속된 저작권을 사용하는 경우 당해
            이용자에게 통보합니다. (근거 : 전자상거래 표준약관 / 공정거래위원회
            2015.6.26)
          </S.Li>
        </S.Ol>
      </S.Article>
      <S.Article>
        <S.H4 id="제14조 (이용자의 게시물)">제14조 (이용자의 게시물)</S.H4>
        <S.Ol>
          <S.Li>
            1. 이용자가 사이버몰에 등록 또는 게시한 게시물에 대한 모든 책임은
            이용자에게 있으며, 회사는 이용자의 게시물이 다음 각 항에 해당한다고
            판단되는 경우에 사전통지 없이 삭제할 수 있고, 이에 대하여 회사는
            어떠한 책임도 지지 않습니다.
            <S.Ul>
              <S.Li depth={2}>① 공공질서와 미풍양속을 저해하는 내용</S.Li>
              <S.Li depth={2}>② 폭력적이거나 저속하고 음란한 내용</S.Li>
              <S.Li depth={2}>
                ③ 불법 복제, 해킹, 기타 현행법을 위반하거나 저촉할 우려가 있는
                내용
              </S.Li>
              <S.Li depth={2}>
                ④ 특정 개인이나 단체를 모욕하거나 명예를 훼손하고 피해를 줄
                의도를 담고 있는 내용
              </S.Li>
              <S.Li depth={2}>
                ⑤ 개인신상에 대한 내용이어서 타인의 명예나 프라이버시를 침해할
                수 있는 내용
              </S.Li>
              <S.Li depth={2}>
                ⑥ 타인의 지적 재산권, 초상권 등 권리를 침해하는 내용
              </S.Li>
              <S.Li depth={2}>
                ⑦ 광고, 홍보, 판촉 등 영리를 목적으로 한 상업적 내용
              </S.Li>
              <S.Li depth={2}>
                ⑧ 사적인 정치적 판단이나 종교적 견해로 이용자간 위화감을
                조장하는 내용
              </S.Li>
              <S.Li depth={2}>
                ⑨ 서비스 각 영역이 규정하고 있는 운영 원칙에 어긋나거나 부합하지
                않는 내용
              </S.Li>
              <S.Li depth={2}>
                ⑩ 이해 당사자의 삭제 요청이 있거나 회사가 피소, 고발될 수 있는
                근거를 제공하는 경우
              </S.Li>
              <S.Li depth={2}>
                ⑪ 동일한 내용을 반복 게시하는 등 다른 이용자의 서비스 이용에
                지장을 초래하는 경우
              </S.Li>
              <S.Li depth={2}>
                ⑫ 정당한 사유 없이 회사의 영업을 방해하는 내용의 게시물
              </S.Li>
              <S.Li depth={2}>
                ⑬ 악성코드나 스파이웨어 등이 실행되어 다른 이용자, 회사, 판매자
                기타 제3자의 시스템 성능 저하, 개인정보 유출 등의 피해를 줄 수
                있는 악의적인 코드를 담고 있는 게시물
              </S.Li>
              <S.Li depth={2}>⑭ 기타 관계법령에 위배된다고 판단되는 내용</S.Li>
            </S.Ul>
          </S.Li>
        </S.Ol>
      </S.Article>
      <S.Article>
        <S.H4 id="제15조 (게시물의 관리)">제15조 (게시물의 관리)</S.H4>
        <S.Ol>
          <S.Li>
            1. 이용자의 게시물이 『정보통신망 이용촉진 및 정보보호 등에 관한
            법률』, 『개인정보 보호법』 및 『저작권법』등 관련 법령에 위반되는
            내용을 포함하는 경우, 권리자는 관련 법령이 정한 절차에 따라 해당
            게시물의 게시중단 및 삭제 등을 요청할 수 있으며, 회사는 관련 법령에
            따라 조치를 취하여야 합니다.
          </S.Li>
          <S.Li>
            2. 회사는 전항에 따른 권리자의 요청이 있는 경우 권리침해가 인정될
            만한 사유가 있거나 기타 회사 정책 및 관련 법령에 위반되는 경우에는
            관련 법령에 따라 해당 게시물에 대해 임시조치 등을 취할 수 있습니다.
            이때, 임시조치 한 사실은 이용자가 알 수 있도록 하고 기간은 30일
            이내로 합니다.
          </S.Li>
          <S.Li>
            3. 이 조에 따른 세부절차는 『정보통신망 이용촉진 및 정보보호 등에
            관한 법률』, 『개인정보 보호법』 및 『저작권법』등 관련 법령이
            규정한 범위 내에서 회사가 정한 정책에 따릅니다.
          </S.Li>
        </S.Ol>
      </S.Article>
    </S.Section>
  );
};

export default TermsArticle4;
