import React from 'react';

import * as S from './TermsArticle.styled';

const TermsArticle1 = () => {
  return (
    <S.Section>
      <S.H3 id="제1장 총칙">제1장 총칙</S.H3>
      <S.Article>
        <S.H4 id="제1조 (목적)">제1조 (목적)</S.H4>
        <S.P>
          본 약관은 리딩레코드㈜(이하 회사라 한다)가 제공하는 인터넷 서비스(이하
          서비스라 하며, 접속 가능한 유·무선 단말기의 종류와는 상관없이 이용
          가능한 회사가 제공하는 모든 서비스를 의미합니다)를 이용함에 있어서
          회사와 이용자의 권리, 의무, 책임 사항 및 서비스 이용절차 등에 관한
          사항을 규정함을 목적으로 합니다.
        </S.P>
        <S.P>
          ※「PC통신, 무선 등을 이용하는 전자상거래에 대해서도 그 성질에 반하지
          않는 한 이 약관을 준용합니다」
        </S.P>
      </S.Article>
      <S.Article>
        <S.H4 id="제2조 (정의)">제2조 (정의)</S.H4>
        <S.Ol>
          이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
          <S.Li>1. 회사란 리딩레코드(주)를 의미합니다.</S.Li>
          <S.Li>
            2. 이용자란 매장에 방문하거나 사이트에 접속하여 이 약관에 따라
            회사가 제공하는 정보 및 기타 서비스를 제공받는 회원을 말합니다.
          </S.Li>
          <S.Li>
            3. 회원이라 함은 회사에 개인정보를 제공하여 회원등록을 한 자로서,
            계속적으로 회사가 제공하는 서비스를 이용할 수 있는 자를 말합니다.
          </S.Li>
          <S.Li>
            4. 아이디(ID)라 함은 회원의 식별과 서비스이용을 위하여 회원이 정하고
            회사가 승인하는 문자 또는 숫자의 조합을 의미합니다.
          </S.Li>
          <S.Li>
            5. 간편가입회원이라 함은 회원가입시 본인인증(실명인증)을 받지 않고
            필수정보만 입력하여 회사가 제공하는 서비스를 이용하는 자를 말합니다.
          </S.Li>
          <S.Li>
            6. 비밀번호라 함은 이용자의 동일성 확인과 이용자의 권익 및
            비밀보호를 위해 이용자 스스로가 설정하여 등록한 문자, 숫자,
            특수문자의 조합을 의미합니다.
          </S.Li>
          <S.Li>
            7. 게시물이라 함은 이용자가 서비스를 이용함에 있어 서비스 상에
            게시한 부호·문자·음성·음향·화상·동영상 등 정보 형태의 글, 사진,
            동영상 및 각종 파일과 링크 등을 의미합니다.
          </S.Li>
          <S.Li>
            8. 본 조에 정의되지 않은 용어는 일반적인 상관례에 따릅니다.
          </S.Li>
        </S.Ol>
      </S.Article>
      <S.Article>
        <S.H4 id="제3조 (약관의 명시 및 개정)">
          제3조 (약관의 명시 및 개정)
        </S.H4>
        <S.Ol>
          <S.Li>
            1. 회사는 이 약관의 내용과 상호 및 대표자의 성명 등을 이용자가 쉽게
            알 수 있도록 회사의 초기 서비스화면(전면)에 게시합니다. 다만, 약관의
            내용은 이용자가 연결화면을 통하여 볼 수 있도록 할 수 있습니다.
          </S.Li>
          <S.Li>
            2. 회사는 『약관의 규제에 관한 법률』, 『전자문서 및
            전자거래기본법』, 『전자서명법』, 『정보통신망 이용촉진 및 정보보호
            등에 관한 법률』, 『전자상거래 등에서의 소비자보호에 관한 법률』,
            『소비자기본법』 등 관련법령을 위배하지 않는 범위에서 이 약관을
            개정할 수 있습니다.
          </S.Li>
          <S.Li>
            3. 회사가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여
            현행약관과 함께 사이트의 초기화면에 그 적용일 7 일 이전부터 적용일자
            전일까지 공지합니다.
          </S.Li>
          <S.Li>
            4. 회사가 개정약관을 공지 또는 통지하면서 회원에게 30일 기간 내에
            의사표시를 하지 않으면 의사표시가 표명된 것으로 본다는 뜻을 명확하게
            공지 또는 고지하였음에도 회원이 명시적으로 거부의 의사표시를 하지
            아니한 경우 회원이 개정약관에 동의한 것으로 봅니다.
          </S.Li>
          <S.Li>
            5. 회원이 개정약관의 적용에 동의하지 않는 경우 회사는 개정 약관의
            내용을 적용할 수 없으며, 이 경우 회원은 회원탈퇴(이용계약의 해지)를
            요청할 수 있습니다. 다만, 기존 약관을 적용할 수 없는 특별한 사정이
            있는 경우에는 회사는 이용계약을 해지할 수 있으며 제4항의 조치에도
            불구하고 약관의 개정 사실을 알지 못함으로써 발생하는 회원의 피해에
            대하여 회사는 책임을 지지 않습니다.
          </S.Li>
          <S.Li>
            6. 본 약관에서 명시하지 않은 사항과 본 약관의 해석에 관하여는
            『전자상거래 등에서의 소비자보호에 관한 법률』, 『약관의 규제에 관한
            법률』, 공정거래위원회가 정하는 전자상거래 등에서의 소비자보호지침
            및 관계법령 또는 상관례에 따릅니다.
          </S.Li>
          <S.Li>
            7. 이 약관의 규정이 대한민국의 강행법규와 상충되는 경우에는 그
            강행법규에 따릅니다. 이 경우 다른 조항의 효력에는 영향을 미치지
            아니합니다.
          </S.Li>
        </S.Ol>
      </S.Article>
      <S.Article>
        <S.H4 id="제4조 (서비스의 제공 및 변경)">
          제4조 (서비스의 제공 및 변경)
        </S.H4>
        <S.Ol>
          <S.Li>1. 회사는 다음과 같은 업무를 수행합니다.</S.Li>
          <S.Ul>
            <S.Li depth={2}>① 다양한 정보의 제공</S.Li>
            <S.Li depth={2}>② 기타 이용자에게 유용한 부가 서비스</S.Li>
          </S.Ul>
        </S.Ol>
      </S.Article>
      <S.Article>
        <S.H4 id="제5조 (서비스의 중단)">제5조 (서비스의 중단)</S.H4>
        <S.Ol>
          <S.Li>
            1. 회사는 컴퓨터 등 정보통신시설의 보수점검 교체 및 고장, 통신의
            두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할
            수 있습니다.
          </S.Li>
          <S.Li>
            2. 사업종목의 전환, 사업의 포기, 업체 간의 통합 등의 이유로 서비스를
            제공할 수 없게 되는 경우에는 회사는 제 6 조에 정한 방법으로
            이용자에게 통지합니다.
          </S.Li>
        </S.Ol>
      </S.Article>
      <S.Article>
        <S.H4 id="제6조 (회원에 대한 통지)">제6조 (회원에 대한 통지)</S.H4>
        <S.Ol>
          <S.Li>
            1. 회사가 회원에 대한 통지를 하는 경우, 회원이 회사에 제출한
            전자우편 주소로 할 수 있습니다. 회원이 통지를 받을 전자우편 주소를
            지정한 때에는 회사의 통지는 부가통신사업자 또는 수신인이 관리하는
            메일서버 등에 도착하여 회원이 검색할 수 있는 상태에 이르렀을 때
            도달된 것으로 보며, 회원이 전자우편을 개봉하였는지 여부, 회원의 PC에
            전자우편이 전송되었는지 여부는 불문합니다.
          </S.Li>
          <S.Li>
            2. 회사는 불특정다수 회원에 대한 통지의 경우 7일 이상 사이트화면에
            게시함으로써 개별 통지에 갈음할 수 있습니다. <br />
            다만, 회원 본인의 거래와 관련하여 중대한 영향을 미치는 사항에
            대하여는 개별 통지를 합니다.
          </S.Li>
        </S.Ol>
      </S.Article>
      <S.Article>
        <S.H4 id="제7조 (회사의 의무)">제7조 (회사의 의무)</S.H4>
        <S.Ol>
          <S.Li>
            1. 회사는 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지
            않으며 이 약관이 정하는 바에 따라 지속적이고, 안정적으로 재화·용역을
            제공하는 데 최선을 다하여야 합니다.
          </S.Li>
        </S.Ol>
      </S.Article>
    </S.Section>
  );
};

export default TermsArticle1;
