import * as S from './TermsArticle.styled';

const TermsArticle5 = () => {
  return (
    <S.Section>
      <S.H3 id="제5장 기타">제5장 기타</S.H3>
      <S.Article>
        <S.H4 id="제16조 (규약 위반시 책임)">제16조 (규약 위반시 책임)</S.H4>
        <S.Ol>
          <S.Li>
            1. 회사와 이용자가 이 규약을 위반함으로써 발생한 모든 책임은 위반한
            자가 부담하며, 이로 인해 상대방에게 손해를 입힌 경우에는 손해를 입힌
            자가 배상하여야 합니다.
          </S.Li>
          <S.Li>
            2. 이 규약에 따른 거래에 관한 소송은 이용자의 소재지에 있는 관할
            법원과 당사가 위치한 관할 법원으로 합니다.
          </S.Li>
        </S.Ol>
      </S.Article>
      <S.Article>
        <S.H4 id="제17조 (면책)">제17조 (면책)</S.H4>
        <S.Ol>
          <S.Li>
            1. 회사는 천재지변, 불가항력 기타 회사의 합리적인 통제범위를 벗어난
            사유로 인하여 서비스를 제공할 수 없는 경우에는 그에 대한 책임을
            부담하지 않습니다.
          </S.Li>
          <S.Li>
            2. 회사는 이용자의 귀책사유로 인하여 서비스를 제공할 수 없는
            경우에는 그에 대한 책임을 부담하지 않습니다.
          </S.Li>
          <S.Li>
            3. 회사는 이용자가 서비스를 이용함으로써 기대되는 수익을 얻지
            못하거나 서비스를 통해 얻은 자료를 이용하여 발생한 손해에 대해서는
            책임을 부담하지 않습니다.
          </S.Li>
          <S.Li>
            4. 이용자가 화면에 게재한 정보, 자료, 사실 등의 내용에 관한 신뢰도
            또는 정확성에 대하여는 해당 이용자가 책임을 부담하며, 회사는 내용의
            부정확 또는 허위로 인해 이용자 또는 제3자에게 발생한 손해에 대하여는
            아무런 책임을 부담하지 않습니다.
          </S.Li>
          <S.Li>
            5. 회사는 서비스 이용과 관련하여 이용자의 고의 또는 과실로 인하여
            이용자 또는 제3자에게 발생한 손해에 대하여는 아무런 책임을 부담하지
            않습니다.
          </S.Li>
        </S.Ol>
      </S.Article>
      <S.Article>
        <S.H4 id="제18조 (재판권 및 준거법)">제18조 (재판권 및 준거법)</S.H4>
        <S.Ol>
          <S.Li>
            1. 회사와 이용자간에 발생한 전자상거래 분쟁에 관한 소송은 제소
            당시의 이용자의 주소에 의하고, 주소가 없는 경우에는 거소를 관할하는
            지방 법원의 전속 관할로 합니다. 다만, 제소 당시 이용자의 주소 또는
            거소가 분명하지 않거나 외국 거주자의 경우에는 민사소송법상의
            관할법원 또는 서울중앙지방법원에 제기합니다.
          </S.Li>
          <S.Li>
            2. 회사와 이용자간의 서비스 이용계약, 회원 상호 간의 물품거래에는
            대한민국 법령이 적용됩니다.
          </S.Li>
        </S.Ol>
      </S.Article>
      <S.Article>
        <S.H4 id="제19조 (법령 및 준용)">제19조 (법령 및 준용)</S.H4>
        <S.P>
          본 약관에 명시하지 않은 사항은 관련 법령과 회사의 규정 및 기타
          상관례에 따릅니다.
        </S.P>
      </S.Article>
    </S.Section>
  );
};

export default TermsArticle5;
